import { useEffect } from 'react';
import './Blog.css';
import { Swiper, SwiperSlide } from 'swiper/react';
import { Navigation } from 'swiper/modules';

function Blog() {
	return (
		<section className="blog">
			<svg
				className="bcg"
				width="329"
				height="306"
				viewBox="0 0 329 306"
				fill="none"
				xmlns="http://www.w3.org/2000/svg"
			>
				<g opacity="0.15">
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 276.152 0)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 276.152 92.7876)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 276.152 185.575)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 276.152 278.363)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 193.309 0)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 193.309 92.7876)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 193.309 185.575)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 193.309 278.363)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 110.461 0)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 110.461 92.7876)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 27.6172 0)"
						fill="#D9D9D9"
					/>
					<circle
						cx="13.8077"
						cy="13.8077"
						r="13.8077"
						transform="matrix(-1 0 0 1 27.6172 92.7876)"
						fill="#D9D9D9"
					/>
				</g>
			</svg>
			<h2 className="blog__title">بلاگ تامین کالا</h2>
			<p className="blog__description">آخرین اخبار و مقالات</p>
			{/* <div className="cards">
				<div className="card">
					<img className="card__image" src="img/c1.png" alt=" عکس ساخت و ساز" />
					<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
					<p className="card__category">دسته بندی : ساختمانی</p>
					<p className="card__content">
						ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
						شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
					</p>
					<button className="card__button">ادامه مطلب</button>
				</div>
				<div className="card">
					<img className="card__image" src="img/c2.png" alt=" عکس ساخت و ساز" />
					<h3 className="card__title">فاکتور های مورد نیاز هر ساختمان</h3>
					<p className="card__category">دسته بندی : ساختمانی</p>
					<p className="card__content">
						ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
						شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
					</p>
					<button className="card__button">ادامه مطلب</button>
				</div>
				<div className="card">
					<img className="card__image" src="img/c3.png" alt=" عکس ساخت و ساز" />
					<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
					<p className="card__category">دسته بندی : ساختمانی</p>
					<p className="card__content">
						ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
						شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
					</p>
					<button className="card__button">ادامه مطلب</button>
				</div>
				<button className="nav-button--right">
					<svg
						width="35"
						height="35"
						viewBox="0 0 35 35"
						fill="none"
						xmlns="http://www.w3.org/2000/svg"
					>
						<g opacity="0.2">
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M17.86 23.0159C18.1249 23.237 18.4307 23.4036 18.7601 23.5064C19.0894 23.6092 19.4358 23.646 19.7794 23.6148C20.123 23.5836 20.4571 23.485 20.7625 23.3245C21.068 23.1641 21.3388 22.9451 21.5595 22.6799L27.3923 15.6799C27.8182 15.1431 28.0173 14.461 27.9471 13.7793C27.8769 13.0976 27.5429 12.4704 27.0164 12.0317C26.49 11.593 25.8128 11.3776 25.1297 11.4314C24.4465 11.4853 23.8115 11.8041 23.3603 12.3199L17.5258 19.3199C17.0804 19.8546 16.8656 20.5444 16.9286 21.2375C16.9916 21.9305 17.3255 22.5702 17.86 23.0159Z"
								fill="white"
							/>
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M17.8592 4.98388C17.3247 5.42956 16.9891 6.06925 16.9261 6.76232C16.8631 7.45539 17.0779 8.14512 17.5232 8.67988L23.3577 15.6799C23.5753 15.9541 23.8455 16.182 24.1524 16.3502C24.4594 16.5184 24.7969 16.6236 25.1451 16.6595C25.4932 16.6953 25.8451 16.6612 26.1799 16.5591C26.5147 16.457 26.8257 16.2889 27.0945 16.0649C27.3634 15.8408 27.5848 15.5652 27.7456 15.2543C27.9064 14.9434 28.0034 14.6035 28.0309 14.2545C28.0584 13.9056 28.0159 13.5547 27.9058 13.2224C27.7957 12.8902 27.6202 12.5833 27.3897 12.3199L21.557 5.31988C21.3363 5.05497 21.0656 4.83613 20.7603 4.67586C20.455 4.5156 20.1211 4.41706 19.7777 4.38585C19.4343 4.35465 19.0882 4.39141 18.759 4.49402C18.4298 4.59663 18.1241 4.76308 17.8592 4.98388Z"
								fill="white"
							/>
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M24.5 14.0001C24.5 13.3039 24.2234 12.6362 23.7312 12.1439C23.2389 11.6516 22.5712 11.3751 21.875 11.3751L7.875 11.3751C7.17881 11.3751 6.51113 11.6516 6.01884 12.1439C5.52656 12.6362 5.25 13.3039 5.25 14.0001C5.25 14.6963 5.52656 15.3639 6.01884 15.8562C6.51113 16.3485 7.17881 16.6251 7.875 16.6251L21.875 16.6251C22.5712 16.6251 23.2389 16.3485 23.7312 15.8562C24.2234 15.3639 24.5 14.6963 24.5 14.0001Z"
								fill="white"
							/>
						</g>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M19.8555 25.1719C20.0338 25.3203 20.2637 25.3919 20.4947 25.3709C20.7257 25.3499 20.939 25.238 21.0875 25.0599L26.9203 18.0599C26.9971 17.9721 27.0556 17.8698 27.0923 17.759C27.129 17.6483 27.1432 17.5313 27.134 17.415C27.1248 17.2987 27.0925 17.1854 27.0389 17.0817C26.9853 16.9781 26.9115 16.8862 26.8219 16.8115C26.7322 16.7368 26.6286 16.6808 26.517 16.6468C26.4054 16.6128 26.2881 16.6014 26.172 16.6133C26.056 16.6253 25.9435 16.6603 25.8412 16.7164C25.7389 16.7725 25.6488 16.8485 25.5763 16.9399L19.7435 23.9399C19.5951 24.1181 19.5235 24.348 19.5445 24.5791C19.5655 24.8101 19.6774 25.0233 19.8555 25.1719Z"
							fill="white"
						/>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M19.8555 9.82798C19.6774 9.97654 19.5655 10.1898 19.5445 10.4208C19.5235 10.6518 19.5951 10.8817 19.7435 11.06L25.5763 18.06C25.6488 18.1514 25.7389 18.2274 25.8412 18.2834C25.9435 18.3395 26.056 18.3745 26.172 18.3865C26.2881 18.3985 26.4054 18.3871 26.517 18.3531C26.6286 18.319 26.7322 18.263 26.8219 18.1883C26.9115 18.1136 26.9853 18.0217 27.0389 17.9181C27.0925 17.8145 27.1248 17.7012 27.134 17.5849C27.1432 17.4686 27.129 17.3516 27.0923 17.2408C27.0556 17.1301 26.9971 17.0278 26.9203 16.94L21.0875 9.93998C20.939 9.76181 20.7257 9.64993 20.4947 9.62893C20.2637 9.60793 20.0338 9.67952 19.8555 9.82798Z"
							fill="white"
						/>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M26.25 17.5C26.25 17.2679 26.1578 17.0454 25.9937 16.8813C25.8296 16.7172 25.6071 16.625 25.375 16.625L8.75 16.625C8.51793 16.625 8.29538 16.7172 8.13128 16.8813C7.96719 17.0454 7.875 17.2679 7.875 17.5C7.875 17.7321 7.96719 17.9546 8.13128 18.1187C8.29538 18.2828 8.51793 18.375 8.75 18.375L25.375 18.375C25.6071 18.375 25.8296 18.2828 25.9937 18.1187C26.1578 17.9546 26.25 17.7321 26.25 17.5Z"
							fill="white"
						/>
					</svg>
				</button>
				<button className="nav-button--left">
					<svg
						width="35"
						height="35"
						viewBox="0 0 35 35"
						fill="none"
						xmlns="http://www.w3.org/2000/svg"
					>
						<g opacity="0.2">
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M17.14 23.0159C16.8751 23.237 16.5693 23.4036 16.2399 23.5064C15.9106 23.6092 15.5642 23.646 15.2206 23.6148C14.877 23.5836 14.5429 23.485 14.2375 23.3245C13.932 23.1641 13.6612 22.9451 13.4405 22.6799L7.60774 15.6799C7.18179 15.1431 6.98266 14.461 7.05289 13.7793C7.12312 13.0976 7.45714 12.4704 7.98359 12.0317C8.51004 11.593 9.18717 11.3776 9.87034 11.4314C10.5535 11.4853 11.1885 11.8041 11.6397 12.3199L17.4742 19.3199C17.9196 19.8546 18.1344 20.5444 18.0714 21.2375C18.0084 21.9305 17.6745 22.5702 17.14 23.0159Z"
								fill="white"
							/>
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M17.1408 4.98388C17.6753 5.42956 18.0109 6.06925 18.0739 6.76232C18.1369 7.45539 17.9221 8.14512 17.4768 8.67988L11.6423 15.6799C11.4247 15.9541 11.1545 16.182 10.8476 16.3502C10.5406 16.5184 10.2031 16.6236 9.85495 16.6595C9.50677 16.6953 9.15493 16.6612 8.82014 16.5591C8.48534 16.457 8.17435 16.2889 7.90545 16.0649C7.63656 15.8408 7.41519 15.5652 7.25438 15.2543C7.09357 14.9434 6.99656 14.6035 6.96905 14.2545C6.94155 13.9056 6.98411 13.5547 7.09423 13.2224C7.20435 12.8902 7.3798 12.5833 7.61027 12.3199L13.443 5.31988C13.6637 5.05497 13.9344 4.83613 14.2397 4.67586C14.545 4.5156 14.8789 4.41706 15.2223 4.38585C15.5657 4.35465 15.9118 4.39141 16.241 4.49402C16.5702 4.59663 16.8759 4.76308 17.1408 4.98388Z"
								fill="white"
							/>
							<path
								fill-rule="evenodd"
								clip-rule="evenodd"
								d="M10.5 14.0001C10.5 13.3039 10.7766 12.6362 11.2688 12.1439C11.7611 11.6516 12.4288 11.3751 13.125 11.3751L27.125 11.3751C27.8212 11.3751 28.4889 11.6516 28.9812 12.1439C29.4734 12.6362 29.75 13.3039 29.75 14.0001C29.75 14.6963 29.4734 15.3639 28.9812 15.8562C28.4889 16.3485 27.8212 16.6251 27.125 16.6251L13.125 16.6251C12.4288 16.6251 11.7611 16.3485 11.2688 15.8562C10.7766 15.3639 10.5 14.6963 10.5 14.0001Z"
								fill="white"
							/>
						</g>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M15.1445 25.1719C14.9662 25.3203 14.7363 25.3919 14.5053 25.3709C14.2743 25.3499 14.061 25.238 13.9125 25.0599L8.07973 18.0599C8.0029 17.9721 7.94442 17.8698 7.90771 17.759C7.87101 17.6483 7.85682 17.5313 7.86599 17.415C7.87515 17.2987 7.90749 17.1854 7.9611 17.0817C8.0147 16.9781 8.08849 16.8862 8.17812 16.8115C8.26775 16.7368 8.37142 16.6808 8.48301 16.6468C8.59461 16.6128 8.71189 16.6014 8.82795 16.6133C8.94401 16.6253 9.05651 16.6603 9.15882 16.7164C9.26114 16.7725 9.3512 16.8485 9.42372 16.9399L15.2565 23.9399C15.4049 24.1181 15.4765 24.348 15.4555 24.5791C15.4345 24.8101 15.3226 25.0233 15.1445 25.1719Z"
							fill="white"
						/>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M15.1445 9.82798C15.3226 9.97654 15.4345 10.1898 15.4555 10.4208C15.4765 10.6518 15.4049 10.8817 15.2565 11.06L9.42373 18.06C9.35121 18.1514 9.26114 18.2274 9.15882 18.2834C9.05651 18.3395 8.94401 18.3745 8.82795 18.3865C8.71189 18.3985 8.59461 18.3871 8.48302 18.3531C8.37142 18.319 8.26775 18.263 8.17812 18.1883C8.08849 18.1136 8.0147 18.0217 7.9611 17.9181C7.90749 17.8145 7.87515 17.7012 7.86599 17.5849C7.85682 17.4686 7.87101 17.3516 7.90771 17.2408C7.94442 17.1301 8.0029 17.0278 8.07973 16.94L13.9125 9.93998C14.061 9.76181 14.2743 9.64993 14.5053 9.62893C14.7363 9.60793 14.9662 9.67952 15.1445 9.82798Z"
							fill="white"
						/>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M8.75 17.5C8.75 17.2679 8.84219 17.0454 9.00628 16.8813C9.17038 16.7172 9.39294 16.625 9.625 16.625L26.25 16.625C26.4821 16.625 26.7046 16.7172 26.8687 16.8813C27.0328 17.0454 27.125 17.2679 27.125 17.5C27.125 17.7321 27.0328 17.9546 26.8687 18.1187C26.7046 18.2828 26.4821 18.375 26.25 18.375L9.625 18.375C9.39294 18.375 9.17038 18.2828 9.00628 18.1187C8.84219 17.9546 8.75 17.7321 8.75 17.5Z"
							fill="white"
						/>
					</svg>
				</button>
				<div class="nav-bg"></div>
				
			</div> */}
			<div className="blog-section">
				<Swiper
					navigation={true}
					modules={[Navigation]}
					slidesPerView={3}
					spaceBetween={50}
					// loop={true}
					className="blog-swiper"
				>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c1.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c2.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">فاکتور های مورد نیاز هر ساختمان</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c3.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c1.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c2.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">فاکتور های مورد نیاز هر ساختمان</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
					<SwiperSlide className="card">
						<img className="card__image" src="img/c3.png" alt=" عکس ساخت و ساز" />
						<h3 className="card__title">راهنمای خرید محصولات ساختمانی برای شروع ساخت و ساز!</h3>
						<p className="card__category">دسته بندی : ساختمانی</p>
						<p className="card__content">
							ابتدا نیاز است که برای ساخت و ساز ساختمان، بررسی و برنامه‌ریزی دقیقی انجام دهید. این
							شامل مطالعه و تحلیل نقشه‌ها، محاسبه هزینه‌ها و تعیین زمانبندی پروژه است.
						</p>
						<button className="card__button">ادامه مطلب</button>
					</SwiperSlide>
				</Swiper>
				<button className="more">
					مشاهده بیشتر
					<svg
						width="24"
						height="24"
						viewBox="0 0 24 24"
						fill="none"
						xmlns="http://www.w3.org/2000/svg"
					>
						<path
							opacity="0.5"
							d="M20 12.75C20.1989 12.75 20.3897 12.671 20.5303 12.5303C20.671 12.3897 20.75 12.1989 20.75 12C20.75 11.8011 20.671 11.6103 20.5303 11.4697C20.3897 11.329 20.1989 11.25 20 11.25L20 12.75ZM20 11.25L4 11.25L4 12.75L20 12.75L20 11.25Z"
							fill="#222222"
						/>
						<path
							d="M10 6L4 12L10 18"
							stroke="#222222"
							stroke-width="1.5"
							stroke-linecap="round"
							stroke-linejoin="round"
						/>
					</svg>
				</button>
			</div>
		</section>
	);
}

export default Blog;
